Repository: psolenny/python-docs-es
Catalog: library/pathlib.po
Languages: es

source: Return a new path object representing the user's home directory (as returned by :func:`os.path.expanduser` with ``~`` construct). If the home directory can't be resolved, :exc:`RuntimeError` is raised.
es: Retorna un nuevo objeto ruta que representa el directorio de inicio del usuario (como lo retorna :func:`os.path.expanduser` con el agregado ``~``). Si el directorio de inicio no se puede resolver, se lanza :exc:`RuntimeError`.

source: Return a :class:`os.stat_result` object containing information about this path, like :func:`os.stat`. The result is looked up at each call to this method.
es: Retorna un objeto :class:`os.stat_result` que contiene información sobre esta ruta, del mismo modo que :func:`os.stat`. El resultado se consulta en cada llamada a este método.

source: This method normally follows symlinks; to stat a symlink add the argument ``follow_symlinks=False``, or use :meth:`~Path.lstat`.
es: Este método normalmente sigue enlaces simbólicos; para evitar enlaces simbólicos, agregue el argumento ``follow_symlinks = False``, o use :meth:`~ Path.lstat`.

source: The *follow_symlinks* parameter was added.
es: Se agregó el parámetro *follow_symlinks*.

source: Change the file mode and permissions, like :func:`os.chmod`.
es: Cambia el modo y los permisos de archivo, como :func:`os.chmod`.

source: This method normally follows symlinks. Some Unix flavours support changing permissions on the symlink itself; on these platforms you may add the argument ``follow_symlinks=False``, or use :meth:`~Path.lchmod`.
es: Este método normalmente sigue enlaces simbólicos. Algunas versiones de Unix admiten el cambio de permisos en el enlace simbólico en sí; en estas plataformas puede agregar el argumento ``follow_symlinks=False``, o usar :meth:`~Path.lchmod`.

source: Return ``True`` if the path points to an existing file or directory.
es: Retorna ``True`` si la ruta apunta a un archivo o directorio existente.

source: This method normally follows symlinks; to check if a symlink exists, add the argument ``follow_symlinks=False``.
es: Este método normalmente sigue enlaces simbólicos; para comprobar si existe un enlace simbólico, agregue el argumento ``follow_symlinks=False``.

source: Return a new path with expanded ``~`` and ``~user`` constructs, as returned by :meth:`os.path.expanduser`. If a home directory can't be resolved, :exc:`RuntimeError` is raised.
es: Retorna una nueva ruta con las construcciones ``~`` y ``~user`` expandidas, como lo retorna :meth:`os.path.expanduser`. Si el directorio de inicio no se puede resolver, se lanza :exc:`RuntimeError`.

source: Glob the given relative *pattern* in the directory represented by this path, yielding all matching files (of any kind)::
es: Analiza el patrón comodín relativo a esta ruta para producir todos los archivos coincidentes (de cualquier tipo):

source: Patterns are the same as for :mod:`fnmatch`, with the addition of "``**``" which means "this directory and all subdirectories, recursively". In other words, it enables recursive globbing::
es: Los patrones son los mismos que para :mod:`fnmatch`, con el agregado de "``**``" que significa "este directorio y todos los subdirectorios de forma recursiva". En otras palabras, habilita el comodín recursivo::

source: By default, or when the *case_sensitive* keyword-only argument is set to ``None``, this method matches paths using platform-specific casing rules: typically, case-sensitive on POSIX, and case-insensitive on Windows. Set *case_sensitive* to ``True`` or ``False`` to override this behaviour.
es: De forma predeterminada, o cuando el argumento de sólo palabra clave *case_sensitive* está configurado en ``None``, este método coincide con las rutas utilizando reglas de mayúsculas y minúsculas específicas de la plataforma: normalmente, distingue entre mayúsculas y minúsculas en POSIX y no distingue entre mayúsculas y minúsculas en Windows. Se configura *case_sensitive* en ``True`` o ``False`` para anular este comportamiento.

source: Using the "``**``" pattern in large directory trees may consume an inordinate amount of time.
es: El uso del patrón "``**``" en grandes árboles de directorios puede consumir una cantidad excesiva de tiempo.

source: Raises an :ref:`auditing event <auditing>` ``pathlib.Path.glob`` with arguments ``self``, ``pattern``.
es: Levanta un :ref:`auditing event <auditing>` ``pathlib.Path.glob`` con argumentos ``self``, ``pattern``.

source: Return only directories if *pattern* ends with a pathname components separator (:data:`~os.sep` or :data:`~os.altsep`).
es: Retorna solo directorios si *pattern* termina con un separador de componentes de nombre de ruta (:data:`~os.sep` o :data:`~os.altsep`).

source: Return the name of the group owning the file. :exc:`KeyError` is raised if the file's gid isn't found in the system database.
es: Retorna el nombre del grupo propietario del archivo. :exc:`KeyError` se genera si el *gid* del archivo no se encuentra en la base de datos del sistema.

source: Return ``True`` if the path points to a directory (or a symbolic link pointing to a directory), ``False`` if it points to another kind of file.
es: Retorna ``True`` si la ruta apunta a un directorio (o un enlace simbólico que apunta a un directorio), ``False`` si apunta a otro tipo de archivo.

source: ``False`` is also returned if the path doesn't exist or is a broken symlink; other errors (such as permission errors) are propagated.
es: ``False`` también se retorna si la ruta no existe o es un enlace simbólico roto; se propagan otros errores (como errores de permiso).

source: Return ``True`` if the path points to a regular file (or a symbolic link pointing to a regular file), ``False`` if it points to another kind of file.
es: Retorna ``True`` si la ruta apunta a un archivo normal (o un enlace simbólico que apunta a un archivo normal), ``Falso`` si apunta a otro tipo de archivo.

source: Return ``True`` if the path points to a junction, and ``False`` for any other type of file. Currently only Windows supports junctions.
es: Retorna ``True`` si la ruta apunta a una unión y ``False`` para cualquier otro tipo de archivo. Actualmente, solo Windows admite uniones.

source: Return ``True`` if the path is a :dfn:`mount point`: a point in a file system where a different file system has been mounted. On POSIX, the function checks whether *path*'s parent, :file:`path/..`, is on a different device than *path*, or whether :file:`path/..` and *path* point to the same i-node on the same device --- this should detect mount points for all Unix and POSIX variants. On Windows, a mount point is considered to be a drive letter root (e.g. ``c:\``), a UNC share (e.g. ``\\server\share``), or a mounted filesystem directory.
es: Retorna ``True`` si la ruta es un :dfn:`mount point`: un punto en un sistema de archivos donde otro sistema de archivo se encuentra montado. En POSIX, la función comprueba si el padre de *path* , :file:`path/..`, se encuentra en un dispositivo diferente que *path*, o si :file:`path/..` y *path* apuntan al mismo i-nodo en el mismo dispositivo --- esto debería detectar puntos de montajes para todas las variantes Unix y POSIX. En Windows, se considera que un punto de montaje es una letra de unidad de raíz (por ejemplo, ``c:\``), un recurso compartido UNC (por ejemplo, ``\\server\share``) o un directorio de sistema de archivos montado.

source: Windows support was added.
es: Se agregó soporte para Windows.

source: Return ``True`` if the path points to a symbolic link, ``False`` otherwise.
es: Retorna ``True`` si la ruta apunta a un enlace simbólico, ``False`` de lo contrario.

source: ``False`` is also returned if the path doesn't exist; other errors (such as permission errors) are propagated.
es: ``False`` también se retorna si la ruta no existe; se extiende a otros errores (como errores de permiso).

source: Return ``True`` if the path points to a Unix socket (or a symbolic link pointing to a Unix socket), ``False`` if it points to another kind of file.
es: Retorna ``True`` si la ruta apunta a un *socket* Unix (o un enlace simbólico que apunta a uno), ``False`` si apunta a otro tipo de archivo.

source: Return ``True`` if the path points to a FIFO (or a symbolic link pointing to a FIFO), ``False`` if it points to another kind of file.
es: Retorna ``True`` si la ruta apunta a un *FIFO* (o un enlace simbólico que apunta a un *FIFO*), ``False`` si apunta a otro tipo de archivo.

source: Return ``True`` if the path points to a block device (or a symbolic link pointing to a block device), ``False`` if it points to another kind of file.
es: Retorna ``True`` si la ruta apunta a un dispositivo de bloques (o un enlace simbólico que apunta a uno), ``False`` si apunta a otro tipo de archivo.

source: Return ``True`` if the path points to a character device (or a symbolic link pointing to a character device), ``False`` if it points to another kind of file.
es: Retorna ``True`` si la ruta apunta a un dispositivo de caracteres (o un enlace simbólico que apunta a uno), ``False`` si apunta a otro tipo de archivo.

source: When the path points to a directory, yield path objects of the directory contents::
es: Cuando la ruta apunta a un directorio, produce objetos de ruta del contenido del directorio::

source: The children are yielded in arbitrary order, and the special entries ``'.'`` and ``'..'`` are not included. If a file is removed from or added to the directory after creating the iterator, whether a path object for that file be included is unspecified.
es: Los hijos se generan en orden arbitrario y las entradas especiales ``'.'`` y ``'..'`` no están incluidas. Si un archivo se elimina o se agrega al directorio después de crear el iterador, no se especifica si se incluirá un objeto de ruta para ese archivo.

source: Generate the file names in a directory tree by walking the tree either top-down or bottom-up.
es: Genera los nombres de archivos en un árbol de directorios recorriendo el árbol de arriba hacia abajo o de abajo hacia arriba.

source: For each directory in the directory tree rooted at *self* (including *self* but excluding '.' and '..'), the method yields a 3-tuple of ``(dirpath, dirnames, filenames)``.
es: Para cada directorio en el árbol de directorios con raíz en *self* (incluyendo *self* pero excluyendo '.' y '..'), el método produce una tupla de 3 de elementos (o tripleta) ``(dirpath, dirnames, filenames)``.

source: *dirpath* is a :class:`Path` to the directory currently being walked, *dirnames* is a list of strings for the names of subdirectories in *dirpath* (excluding ``'.'`` and ``'..'``), and *filenames* is a list of strings for the names of the non-directory files in *dirpath*. To get a full path (which begins with *self*) to a file or directory in *dirpath*, do ``dirpath / name``. Whether or not the lists are sorted is file system-dependent.
es: *dirpath* es un objeto :class:`Path` al directorio que se está recorriendo actualmente, *dirnames* es una lista de cadenas de caracteres para los nombres de los subdirectorios en *dirpath* (excluyendo ``'.'`` y ``'..'``), y *filenames* es una lista de cadenas de caracteres para los nombres de los archivos que no son directorios en *dirpath*. Para obtener una ruta completa (que comienza con *self*) a un archivo o directorio en *dirpath*, se ejecuta ``dirpath / name``. El orden de las listas depende del sistema de archivos.

source: If the optional argument *top_down* is true (which is the default), the triple for a directory is generated before the triples for any of its subdirectories (directories are walked top-down). If *top_down* is false, the triple for a directory is generated after the triples for all of its subdirectories (directories are walked bottom-up). No matter the value of *top_down*, the list of subdirectories is retrieved before the triples for the directory and its subdirectories are walked.
es: Si el argumento opcional *top_down* es verdadero (que es el valor predeterminado), la tripleta de un directorio se genera antes que las tripletas de cualquiera de sus subdirectorios (los directorios se recorren de arriba hacia abajo). Si *top_down* es falso, la tripleta de un directorio se genera después de las tripletas de todos sus subdirectorios (los directorios se recorren de abajo hacia arriba). Sin importar el valor de *top_down*, la lista de subdirectorios se recupera antes de que se recorran las tripletas del directorio y sus subdirectorios.

source: When *top_down* is true, the caller can modify the *dirnames* list in-place (for example, using :keyword:`del` or slice assignment), and :meth:`Path.walk` will only recurse into the subdirectories whose names remain in *dirnames*. This can be used to prune the search, or to impose a specific order of visiting, or even to inform :meth:`Path.walk` about directories the caller creates or renames before it resumes :meth:`Path.walk` again. Modifying *dirnames* when *top_down* is false has no effect on the behavior of :meth:`Path.walk()` since the directories in *dirnames* have already been generated by the time *dirnames* is yielded to the caller.
es: Cuando *top_down* es verdadero, el llamador puede modificar la lista *dirnames* en el lugar (por ejemplo, al usar :keyword:`del` o la asignación de segmentos), y :meth:`Path.walk` solo recurrirá a los subdirectorios cuyos nombres permanezcan en *dirnames*. Esto se puede usar para reducir la búsqueda, o para imponer un orden específico de visita, o incluso para informar a :meth:`Path.walk` sobre los directorios que el llamador crea o renombra antes de que reanude :meth:`Path.walk` nuevamente. Modificar *dirnames* cuando *top_down* es falso no tiene efecto en el comportamiento de :meth:`Path.walk()` ya que los directorios en *dirnames* ya se han generado en el momento en que *dirnames* se entrega al llamador.

source: By default, errors from :func:`os.scandir` are ignored. If the optional argument *on_error* is specified, it should be a callable; it will be called with one argument, an :exc:`OSError` instance. The callable can handle the error to continue the walk or re-raise it to stop the walk. Note that the filename is available as the ``filename`` attribute of the exception object.
es: De forma predeterminada, los errores de :func:`os.scandir` se ignoran. Si se especifica el argumento opcional *on_error*, debe ser un objeto invocable; se llamará con un argumento, una instancia de :exc:`OSError`. El objeto invocable puede manejar el error para continuar la ejecución o volver a generarlo para detenerla. Tenga en cuenta que el nombre del archivo está disponible como el atributo ``filename`` del objeto de excepción.

source: By default, :meth:`Path.walk` does not follow symbolic links, and instead adds them to the *filenames* list. Set *follow_symlinks* to true to resolve symlinks and place them in *dirnames* and *filenames* as appropriate for their targets, and consequently visit directories pointed to by symlinks (where supported).
es: De forma predeterminada, :meth:`Path.walk` no sigue los enlaces simbólicos, sino que los agrega a la lista *filenames*. Establezca *follow_symlinks* como verdadero para resolver los enlaces simbólicos y colocarlos en *dirnames* y *filenames* según corresponda para sus destinos y, en consecuencia, visitar los directorios a los que apuntan los enlaces simbólicos (donde sea compatible).

source: Be aware that setting *follow_symlinks* to true can lead to infinite recursion if a link points to a parent directory of itself. :meth:`Path.walk` does not keep track of the directories it has already visited.
es: Tener en cuenta que establecer *follow_symlinks* como verdadero puede generar una recursión infinita si un enlace apunta a un directorio principal de sí mismo. :meth:`Path.walk` no realiza un seguimiento de los directorios que ya ha visitado.

source: :meth:`Path.walk` assumes the directories it walks are not modified during execution. For example, if a directory from *dirnames* has been replaced with a symlink and *follow_symlinks* is false, :meth:`Path.walk` will still try to descend into it. To prevent such behavior, remove directories from *dirnames* as appropriate.
es: :meth:`Path.walk` asume que los directorios que recorre no se modifican durante la ejecución. Por ejemplo, si un directorio de *dirnames* ha sido reemplazado por un enlace simbólico y *follow_symlinks* es falso, :meth:`Path.walk` intentará descender a él. Para evitar este comportamiento, elimine los directorios de *dirnames* según corresponda.

source: Unlike :func:`os.walk`, :meth:`Path.walk` lists symlinks to directories in *filenames* if *follow_symlinks* is false.
es: A diferencia de :func:`os.walk`, :meth:`Path.walk` enumera enlaces simbólicos a directorios en *filenames* si *follow_symlinks* es falso.

source: This example displays the number of bytes used by all files in each directory, while ignoring ``__pycache__`` directories::
es: Este ejemplo muestra la cantidad de bytes utilizados por todos los archivos en cada directorio, mientras ignora los directorios ``__pycache__``::

source: This next example is a simple implementation of :func:`shutil.rmtree`. Walking the tree bottom-up is essential as :func:`rmdir` doesn't allow deleting a directory before it is empty::
es: El siguiente ejemplo es una implementación simple de :func:`shutil.rmtree`. Recorrer el árbol de abajo a arriba es esencial ya que :func:`rmdir` no permite eliminar un directorio antes de que esté vacío::

source: Like :meth:`Path.chmod` but, if the path points to a symbolic link, the symbolic link's mode is changed rather than its target's.
es: Del mismo modo que :meth:`Path.chmod` pero si la ruta apunta a un enlace simbólico, el modo del enlace simbólico cambia en lugar del de su objetivo.

source: Like :meth:`Path.stat` but, if the path points to a symbolic link, return the symbolic link's information rather than its target's.
es: Del mismo modo que :meth:`Path.stat` pero si la ruta apunta a un enlace simbólico, retorna la información del enlace simbólico en lugar de la de su objetivo.

source: Create a new directory at this given path. If *mode* is given, it is combined with the process' ``umask`` value to determine the file mode and access flags. If the path already exists, :exc:`FileExistsError` is raised.
es: Crea un nuevo directorio en la ruta dada. Si se proporciona *mode*, se combina con el valor del proceso ``umask`` para determinar el modo de archivo y los derechos de acceso. Si la ruta ya existe, se genera :exc:`FileExistsError`.

source: If *parents* is true, any missing parents of this path are created as needed; they are created with the default permissions without taking *mode* into account (mimicking the POSIX ``mkdir -p`` command).
es: Si *parents* es verdadero, los padres que faltan de esta ruta se crean según sea necesario; se crean con los permisos predeterminados sin tener en cuenta *mode* (imitando el comando POSIX ``mkdir -p``).

source: If *parents* is false (the default), a missing parent raises :exc:`FileNotFoundError`.
es: Si *parents* es falso (el valor predeterminado), se genera un padre que falta :exc:`FileNotFoundError`.

source: If *exist_ok* is false (the default), :exc:`FileExistsError` is raised if the target directory already exists.
es: Si *exist_ok* es falso (el valor predeterminado), se genera :exc:`FileExistsError` si el directorio de destino ya existe.

source: If *exist_ok* is true, :exc:`FileExistsError` exceptions will be ignored (same behavior as the POSIX ``mkdir -p`` command), but only if the last path component is not an existing non-directory file.
es: Si *exist_ok* es verdadero, se ignorarán las excepciones :exc:`FileExistsError` (el mismo comportamiento que el comando POSIX ``mkdir -p``), pero solo si el último componente de ruta no es un archivo existente que no sea de directorio.

source: The *exist_ok* parameter was added.
es: Se agregó el parámetro *exist_ok*.

source: Open the file pointed to by the path, like the built-in :func:`open` function does::
es: Abre el archivo señalado por la ruta, como lo hace la función incorporada :func:`open`::

source: Return the name of the user owning the file. :exc:`KeyError` is raised if the file's uid isn't found in the system database.
es: Retorna el nombre del usuario propietario del archivo. :exc:`KeyError` se genera si el *uid* del archivo no se encuentra en la base de datos del sistema.

source: Return the binary contents of the pointed-to file as a bytes object::
es: Retorna el contenido binario del archivo apuntado como un objeto bytes::

source: Return the decoded contents of the pointed-to file as a string::
es: Retorna el contenido decodificado del archivo apuntado como una cadena::

source: The file is opened and then closed. The optional parameters have the same meaning as in :func:`open`.
es: El archivo se abre y luego se cierra. Los parámetros opcionales funcionan de la misma manera que en :func:`open`.

source: Return the path to which the symbolic link points (as returned by :func:`os.readlink`)::
es: Retorna la ruta a la que apunta el vínculo simbólico (como lo retorna :func:`os.readlink`)::

source: Rename this file or directory to the given *target*, and return a new Path instance pointing to *target*. On Unix, if *target* exists and is a file, it will be replaced silently if the user has permission. On Windows, if *target* exists, :exc:`FileExistsError` will be raised. *target* can be either a string or another path object::
es: Cambia el nombre de este archivo o directorio al *target* dado y retorna una nueva instancia de *Path* apuntando al *target*. En Unix, si el *target* existe y es un archivo, se reemplazará silenciosamente si el usuario tiene permiso. En Windows, si el *target* existe, se lanzará una excepción :exc:`FileExistsError`. El *target* puede ser una cadena u otro objeto de ruta:

source: The target path may be absolute or relative. Relative paths are interpreted relative to the current working directory, *not* the directory of the Path object.
es: La ruta de destino puede ser absoluta o relativa. Las rutas de acceso relativas se interpretan en relación con el directorio de trabajo actual, *no* el directorio del objeto Path.

source: It is implemented in terms of :func:`os.rename` and gives the same guarantees.
es: Se implementa en términos de :func:`os.rename` y ofrece las mismas garantías.

source: Added return value, return the new Path instance.
es: Valor de retorno agregado, retorna la nueva instancia de *Path*.

source: Rename this file or directory to the given *target*, and return a new Path instance pointing to *target*. If *target* points to an existing file or empty directory, it will be unconditionally replaced.
es: Cambia el nombre de este archivo o directorio al *target* dado y retorna una nueva instancia de *Path* que apunte a *target*. Si *target* apunta a un archivo existente o a un directorio vacío, se reemplazará incondicionalmente.

source: Make the path absolute, without normalization or resolving symlinks. Returns a new path object::
es: Hace que la ruta sea absoluta, sin normalización ni resolución de enlaces simbólicos. Retorna un nuevo objeto de ruta::

source: Make the path absolute, resolving any symlinks. A new path object is returned::
es: Hace que la ruta sea absoluta, resolviendo los enlaces simbólicos. Se retorna un nuevo objeto ruta::

source: "``..``" components are also eliminated (this is the only method to do so)::
es: Los componentes "``..``" también se eliminan (este es el único método para hacerlo)::
