Repository: psolenny/python-docs-es
Catalog: library/pathlib.po
Languages: es

source: If the path doesn't exist and *strict* is ``True``, :exc:`FileNotFoundError` is raised. If *strict* is ``False``, the path is resolved as far as possible and any remainder is appended without checking whether it exists. If an infinite loop is encountered along the resolution path, :exc:`RuntimeError` is raised.
es: Si la ruta no existe y *strict* es ``True``, se genera :exc:`FileNotFoundError`. Si *strict* es ``False``, la ruta se resuelve en la medida de lo posible y se agrega el resto sin verificar si existe. Si se encuentra un bucle infinito en la resolución de la ruta se genera :exc:`RuntimeError`.

source: The *strict* parameter was added (pre-3.6 behavior is strict).
es: Se agregó el parámetro *strict* (el comportamiento previo a 3.6 es *strict*).

source: Glob the given relative *pattern* recursively. This is like calling :func:`Path.glob` with "``**/``" added in front of the *pattern*, where *patterns* are the same as for :mod:`fnmatch`::
es: Agrupa el *pattern* relativo dado de forma recursiva. Esto es como llamar a :func:`Path.glob` con "``**/``" agregado antes del *pattern*, donde los *patterns* son los mismos que para :mod:`fnmatch`::

source: Raises an :ref:`auditing event <auditing>` ``pathlib.Path.rglob`` with arguments ``self``, ``pattern``.
es: Levanta un :ref:`auditing event <auditing>` ``pathlib.Path.rglob`` con argumentos ``self``, ``pattern``.

source: Remove this directory. The directory must be empty.
es: Elimina el directorio. El directorio debe estar vacío.

source: Return whether this path points to the same file as *other_path*, which can be either a Path object, or a string. The semantics are similar to :func:`os.path.samefile` and :func:`os.path.samestat`.
es: Retorna si la ruta apunta al mismo archivo que *other_path*, que puede ser un objeto *Path* o una cadena. La semántica es similar a :func:`os.path.samefile` y :func:`os.path.samestat`.

source: An :exc:`OSError` can be raised if either file cannot be accessed for some reason.
es: Se puede generar :exc:`OSError` si no se accede a alguno de los archivos por algún motivo.

source: Make this path a symbolic link to *target*. Under Windows, *target_is_directory* must be true (default ``False``) if the link's target is a directory. Under POSIX, *target_is_directory*'s value is ignored.
es: Hace de la ruta un enlace simbólico a *target*. En Windows, *target_is_directory* debe ser verdadero si el destino del enlace es un directorio (``False`` es predeterminado). En POSIX, el valor de *target_is_directory* se ignora.

source: The order of arguments (link, target) is the reverse of :func:`os.symlink`'s.
es: El orden de los argumentos (*link*, *target*) es el reverso de :func:`os.symlink`'s.

source: Make this path a hard link to the same file as *target*.
es: Hace de esta ruta un enlace fijo que apunta al mismo archivo que *target*.

source: The order of arguments (link, target) is the reverse of :func:`os.link`'s.
es: El orden de los argumentos (link, target) es el reverso de :func:`os.link`.

source: Create a file at this given path. If *mode* is given, it is combined with the process' ``umask`` value to determine the file mode and access flags. If the file already exists, the function succeeds if *exist_ok* is true (and its modification time is updated to the current time), otherwise :exc:`FileExistsError` is raised.
es: Crea un archivo en la ruta dada. Si se proporciona *mode*, se combina con el valor del proceso ``umask`` para determinar el modo de archivo y los indicadores de acceso. Si el archivo ya existe, la función tiene éxito si *exist_ok* es verdadero (y su hora de modificación se actualiza a la hora actual), de lo contrario se genera :exc:`FileExistsError`.

source: Remove this file or symbolic link. If the path points to a directory, use :func:`Path.rmdir` instead.
es: Elimine el archivo o enlace simbólico. Si la ruta apunta a un directorio, use :func:`Path.rmdir` en su lugar.

source: If *missing_ok* is false (the default), :exc:`FileNotFoundError` is raised if the path does not exist.
es: Si *missing_ok* es falso (el valor predeterminado), se genera :exc:`FileNotFoundError` si la ruta no existe.

source: If *missing_ok* is true, :exc:`FileNotFoundError` exceptions will be ignored (same behavior as the POSIX ``rm -f`` command).
es: Si *missing_ok* es verdadero, las excepciones :exc:`FileNotFoundError` serán ignoradas (el mismo comportamiento que el comando POSIX ``rm -f``).

source: The *missing_ok* parameter was added.
es: Se agregó el parámetro *missing_ok*.

source: Open the file pointed to in bytes mode, write *data* to it, and close the file::
es: Abre el archivo apuntado en modo bytes, escribe *data* y cierra el archivo::

source: An existing file of the same name is overwritten.
es: Se sobrescribe un archivo existente con el mismo nombre.

source: Open the file pointed to in text mode, write *data* to it, and close the file::
es: Abre el archivo apuntado en modo texto, escribe *data* y cierra el archivo::

source: An existing file of the same name is overwritten. The optional parameters have the same meaning as in :func:`open`.
es: Se sobrescribe un archivo existente con el mismo nombre. Los parámetros opcionales tienen el mismo significado que en :func:`open`.

source: The *newline* parameter was added.
es: Se agregó el parámetro *newline*.

source: Correspondence to tools in the :mod:`os` module
es: Correspondencia a herramientas en el módulo :mod:`os`

source: Below is a table mapping various :mod:`os` functions to their corresponding :class:`PurePath`/:class:`Path` equivalent.
es: A continuación se muestra una tabla que asigna varias funciones :mod:`os` a sus equivalentes en :class:`PurePath`/:class:`Path`.

source: Not all pairs of functions/methods below are equivalent. Some of them, despite having some overlapping use-cases, have different semantics. They include :func:`os.path.abspath` and :meth:`Path.absolute`, :func:`os.path.relpath` and :meth:`PurePath.relative_to`.
es: No todos los pares de funciones/métodos a continuación son equivalentes. Algunos de ellos, a pesar de tener algunos casos de uso superpuestos, tienen una semántica diferente. Incluyen :func:`os.path.abspath` y :meth:`Path.absolute`, :func:`os.path.relpath` y :meth:`PurePath.relative_to`.

source: :mod:`os` and :mod:`os.path`
es: :mod:`os` y :mod:`os.path`

source: :meth:`Path.expanduser` and :meth:`Path.home`
es: :meth:`Path.expanduser` y :meth:`Path.home`

source: :attr:`PurePath.stem` and :attr:`PurePath.suffix`
es: :attr:`PurePath.stem` y :attr:`PurePath.suffix`

source: Footnotes
es: Notas al pie

source: :func:`os.path.abspath` normalizes the resulting path, which may change its meaning in the presence of symlinks, while :meth:`Path.absolute` does not.
es: :func:`os.path.abspath` normaliza la ruta resultante, lo cual puede cambiar su significado en presencia de enlaces simbólicos, mientras que :meth:`Path.absolute` no lo hace.

source: :meth:`PurePath.relative_to` requires ``self`` to be the subpath of the argument, but :func:`os.path.relpath` does not.
es: :meth:`PurePath.relative_to` requiere que ``self`` sea la ruta secundaria del argumento, pero :func:`os.path.relpath` no.
